export const singleProductLoclization = {
  color: "رنگ",
  white: "سفید",
  black: "مشکی",
  details: "مشخصات",
  price: "قیمت : ",
  inStock: " عدد در انبار موجود است.",
  addToCard: "افزودن به سبد خرید",
  os: "نوع سیستم‌ عامل",
  screen: "ابعاد نمایشگر",
  inch: "اینچ",
  "5g": "پشتیبانی از 5G",
  have: "دارد",
  ramAndSd: "ترکیب حافظه داخلی و رم",
  GB: "گیگابایت",
};

export const productslocalization = {
  products: "صفحه محصولات",
  all: "همه",
  apple: "اپل",
  samsung: "سامسونگ",
  xiaomi: "شیائومی",
  huawei: "هواوی",
  nokia: "نوکیا",
  nothingPhone: "ناثینگ فون",
  google: "گوگل پیکسل",
  microsoft: "مایکروسافت",
  price: "تومان",
};

export const headerLocalization = {
  parmisar: "پارمیسار",
  searchPlaceholder: "جستجو محصول...",
};

export const navLinksLocalization = {
  home: "صفحه اصلی",
  tricks: "ترفند",
  news: "اخبار",
  contactUs: "تماس با ما",
  aboutUs: "درباره ما",
  newestNews: "جدیدترین اخبار",
  techNews: "اخبار تکنولوژی",
  mobileNews: "اخبار موبایل",
};

export const heroLocalization = {
  year: "سال",
  bestPhones: "بهترین گوشی‌های ",
  withOffers: "با تخفیف های استثنائی ",
  heroDescription:
    " جدیدترین مدل‌های اپل، سامسونگ، شیائومی و برندهای دیگر را با بهترین قیمت خریداری کنید.",
  callToAction: "مشاهده محصولات",
};

export const featuredProductsLocalization = {
  specialProducts: "محصولات ویژه",
  showProduct: "مشاهده محصول",
  currency: "تومان",
  description1: "مناسب برای گیمرها و حرفه‌ای‌ها با پردازنده قدرتمند",
  description2: "دوربین حرفه‌ای و نمایشگر عالی برای تماشای فیلم",
  description3: "طراحی مدرن و باتری با عمر طولانی",
  description4: "بهترین انتخاب برای علاقه‌مندان به اندروید خالص",
};

export const productCategoryLocalization = {
  setCategory: "دسته‌بندی محصولات بر اساس برند",
};

export const reviewsLocalization = {
  title1: "بررسی Redmi Note 14Pro+ شیائومی",
  description1: "شارژ فوق سریع 21 دقیقه ای",
  title2: "تست گیمینگ گوشی S25 Ultra سامسونگ",
  description2: "مگه تو بازی کم میاره!؟",
  title3: "بررسی گوشی Huawei Mate XT Ultimate",
  description3: "بررسی گرون ترین گوشی بازار",
  title4: "کالبدشکافی گوشی Nothing CMF Phone 1",
  description4: "!زنده بیرون آمدن از همه تست ها",
};

export const offerLocalization = {
  firstOffer: "🎉 تخفیف ویژه برای اولین خرید!",
  description: "   همین حالا ثبت‌ نام کن و یک کد تخفیف ۱۰٪ دریافت کن!",
  receiveOffer: "دریافت کد تخفیف",
};

export const storeBenefitsLocalization = {
  whyUS: " چرا پارمیسار؟",
  freeDelivery: "ارسال رایگان",
  freeDeliveryDescription:
    "تمامی سفارش‌ها بدون هزینه ارسال به دست شما می‌رسند.",
  guarantee: "ضمانت بازگشت وجه",
  guaranteeDescription:
    "اگر از خرید خود راضی نبودید، وجه شما بازگشت داده می‌شود.",
  support: " پشتیبانی ۲۴/۷",
  supportDescription: "ما همیشه در کنار شما هستیم تا به سوالات شما پاسخ دهیم.",
  safePay: "پرداخت امن",
  safePayDescription: "پرداخت‌های شما کاملاً امن و با رمزگذاری انجام می‌شوند.",
};

export const footerLocalization = {
  emailError: "لطفاً ایمیل خود را وارد کنید.",
  noValidatedError: "لطفاً یک ایمیل معتبر وارد کنید.",
  successEmail: "ایمیل ثبت شد.",
  aboutStore: "درباره فروشگاه",
  aboutStoreDescription:
    "فروشگاه آنلاین ما با هدف ارائه بهترین تجربه خرید اینترنتی برای شما، محصولات با کیفیت بالا و قیمت مناسب را ارائه می‌دهد. هدف ما رضایت کامل مشتریان است.",
  links: "لینک‌های سریع",
  aboutUs: "درباره ما",
  contactUs: "تماس با ما",
  terms: "شرایط استفاده",
  address: "آدرس: تهران، ساختمان مکتب شریف",
  phone: "تلفن: 00000000-9821+",
  email: "ایمیل: parmisarShop@example.com",
  withUs: "همراه ما باشید!",
  emailPropose: "با ثبت ایمیل از جدیدترین اخبار و تخفیف ها باخبر شوید.",
  emailPlaceholder: "ایمیل خود را وارد کنید...",
  register: "ثبت",
  copyRight: " فروشگاه آنلاین، تمام حقوق محفوظ است.",
};

export const termsLocalization = {
  heading: "شرایط و قوانین استفاده از سرویس‌ها و خدمات پارمیسار",
  hint: "کاربر گرامی لطفاً موارد زیر را جهت استفاده بهینه از خدمات و برنامه‌‏های کاربردی پارمیسار به دقت ملاحظه فرمایید.",
  paragraphOfHeading:
    "ورود کاربران به وب‏‌سایت پارمیسار هنگام استفاده از پروفایل شخصی، طرح‏‌های تشویقی، ویدئوهای رسانه تصویری پارمیسار و سایر خدمات ارائه شده توسط پارمیسار به معنای آگاه بودن و پذیرفتن شرایط و قوانین و همچنین نحوه استفاده از سرویس‌‏ها و خدمات پارمیسار است. توجه داشته باشید که ثبت سفارش نیز در هر زمان به معنی پذیرفتن کامل کلیه شرایط و قوانین پارمیسار از سوی کاربر است. لازم به ذکر است شرایط و قوانین مندرج، جایگزین کلیه توافق‏‌های قبلی محسوب می‏‌شود.",
  notes:
    " موارد زیر را جهت استفاده بهینه از خدمات پروفایل عمومی به دقت مطالعه فرمایید:",
  p1: "  ۱. کاربر با ساخت حساب کاربری، پروفایل عمومی پارمیسار هم خواهد داشت.",
  p2: " ۲. پروفایل عمومی ایجاد شده، تنها با غیر فعال کردن حساب کاربری، غیر فعال خواهد شد.",
  p3: "۳. پارمیسار مسئولیتی در خصوص فعالیت های غیر مجاز (مطالب و نظرات سیاسی، قومیت گرا، تفرقه آمیز، اطلاعات محرمانه دیگران، مطالب غیراخلاقی و غیر قانونی) نداشته و در صورت انجام تخلف، اطلاعات فرد با حکم قضایی تحویل نهادهای قانونی می شود.",
};
export const contactUsLocalization = {
  contactUs: "تماس با ما",
  description:
    "ایمیل بزنید، تماس بگیرید یا فرم را پر کنید تا بدانید چگونه پارمیسار می‌تواند مشکل شما را حل کند.",
  phoneNumber: " .۲۱-۲۲۱۲۳۱۳۳ ",
  customerSupport: " پشتیبانی مشتریان ",
  supportDescription:
    " تیم پشتیبانی ما به صورت شبانه‌روزی آماده پاسخگویی به هرگونه نگرانی یا سؤالات شمااست. ",
  reactionAndQuestions: " بازخورد و پیشنهادات  ",
  description2:
    " ما به بازخورد شما ارزش می‌نهیم و به طور مداوم در حال بهبود پارمیسار هستیم. نظرات شما در شکل‌گیری آینده‌ی پارمیسار حیاتی است. ",
  frequentlyQuestions: " سؤالات متداول  ",
  questionLink: " برای پرسش‌های متداول، لطفاً روی لینک زیر کلیک کنید. ",
  stayInCall: " در تماس باشید  ",
  callAnyTime: " شما می‌توانید هر زمان با ما در ارتباط باشید ",
  name: "نام",
  lastName: " نام خانوادگی ",
  email: " ایمیل شما",
  phone: " شماره تلفن",
  howHelp: "چگونه می‌توانیم کمک کنیم؟",
  send: " ارسال ",
  privacy: " با تماس با ما، شما با شرایط استفاده و ",
  privacyLink: " سیاست حفظ حریم خصوصی ",
  privacy2: " ما موافقت می‌کنید. ",
  successMessage: "اطلاعات با موفقیت ارسال شد.",
};

export const aboutUsLocalization = {
  aboutUs: "درباره ما",
  whoWeAre: " ما کی هستیم؟ ",
  paragraph:
    " ما گروهی از افراد کنجکاو و همفکر هستیم که دوست داریم دائماً پتانسیل خود را در فناوری که هر روز در حال پیشرفت است کشف کنیم. هیچکس کامل به دنیا نمی آید و ما نیز از یک کارگاه کوچک شروع کردیم و به جایی رسیدیم که اکنون هستیم. ما در یک شهر کوچک اما درخشان در ایران مستقر هستیم. اگرچه ریشه های ما در ایران است، اما همیشه در کاوش و همکاری با مردم در نقاط مختلف جهان موفق بوده ایم. ",
  ourValue: " ارزش های ما ؟ ",
  adventure: " ماجراجویی  ",
  hardWorking: " سخت کوشی  ",
  progress: " پیشرفت  ",
  empathy: " همدلی  ",
  ourTeam: " تیم ما ",
};

export const loginLocalization = {
  Login: " ورود",
  DontHaveAccount: "آیا قبلا حساب کاربری نداشتید؟",
  SignupHere: " ثبت نام کنید ",
  Email: " ایمیل ",
  Password: " رمز ورود ",
  RememberMe: " مرا بخاطر بسپار ",
  ForgotPassword: " فراموشی رمز عبور ",
  EnterEmail: " ایمیل خود را وارد کنید ",
  EnterPassword: " رمز خود را وارد کنید ",
};
export const signUpLocalization = {
  Password: " رمز ورود ",
  EnterPassword: " رمز خود را وارد کنید  ",
  signUpDescription:
    " با ثبت نام، با دریافت به روز رسانی ها و پیشنهادات ویژه موافقت می کنید. ",
  Signup: " ثبت نام ",
  AlreadyHaveAccount: " آیا قبلا حساب کاربری داشتید؟ ",
  Login: "ورود",
  Name: " نام ",
  EnterName: " نام خود را وارد کنید ",
  Email: " ایمیل ",
  EnterEmail: " ایمیل خود را وارد کنید  ",
};
